"""
Адміністратор університетського серверу Сергій щоранку переглядає логи доступу до навчальної платформи Moodle. Його цікавить одне просте питання: скільки унікальних IP-адрес зверталося до сервера за ніч? Якщо таких більше 1000 — можливо, хтось знову намагається брутфорсити логіни студентів перед іспитом.
Виведи кількість унікальних IP та позначку тривоги, якщо потрібно.
Вхідні дані
Перший рядок містить ціле число L — кількість записів у лозі
Кожен із наступних L рядків містить рядок — IP-адресу у форматі a.b.c.d

Вихідні дані
Перший рядок: кількість унікальних IP-адрес.
Другий рядок: ALERT якщо унікальних IP більше 1000, або OK інакше.

Приклад
Input:
5
192.168.1.1
10.0.0.1
192.168.1.1
172.16.0.5
10.0.0.1

Output:
3
OK
"""

def countIP():
    entriesAmount = int(input())
    ips = []
    for i in range(entriesAmount):
        ips.append(input())
    ipss = set(ips)
    print(len(ipss))
    if len(ipss) > 1000:
        print("ALERT")
    else:
        print("OK")

countIP()