"""
Легенда
Студент Олег живе в кімнаті 212 — і якось вночі перед сесією зауважив, що номер його кімнати читається однаково зліва направо і справа наліво. «Паліндром!» — вигукнув він і прокинув сусіда. Сусід образився і поставив умову: Олег має написати програму, яка перевіряє, чи є рядок паліндромом. Інакше — тиша до ранку.
Рядок є паліндромом, якщо він читається однаково в обох напрямках. Перевірка має бути регістронезалежною та ігнорувати всі символи, що не є літерами або цифрами.
Вхідні дані
Один рядок довжиною від 11 1 до 10510^5 105, що може містити будь-які ASCII-символи.
Вихідні дані
Виведіть YES, якщо рядок є паліндромом (після фільтрації та приведення до нижнього регістру), або NO інакше.
Приклад
Input:
A man, a plan, a canal: Panama

Output:
YES
Input:
race a car

Output:
NO
"""
import re
def isPalindrom():
    text = input()
    text = text.lower()
    text = re.sub(r'[^a-z0-9]', '', text)
    if text == text[::-1]:
        print("YES")
    else: print("NO")

isPalindrom()