"""
Іванко має список завдань із дедлайнами — він записував їх у довільному порядку в нотатках телефону. Тепер сесія на носі, і йому потрібно відсортувати завдання: спочатку за датою здачі (від найближчої до найдальшої), а якщо дедлайн однаковий — за назвою завдання в лексикографічному порядку.
Іванко обіцяє, що якщо програма впорається, він нарешті почне виконувати завдання, а не лише сортувати їх.
Вхідні дані
Перший рядок містить ціле число N — кількість завдань
Кожен із наступних NN N рядків містить рядок task (назва завдання без пробілів, довжина до 30) та ціле число d — дедлайн у форматі «кількість днів від сьогодні» 
Вихідні дані
Виведіть N рядків у відсортованому порядку: спочатку дедлайн, потім назва завдання.
Приклад

Input:
4
Lab2_OOP 5
Essay_English 3
Lab1_Discrete 5
Project_DB 1

Output:
1 Project_DB
3 Essay_English
5 Lab1_Discrete
5 Lab2_OOP
"""
def sortTasks():
    amountTasks = int(input())
    tasks = {}
    for i in range(amountTasks):
        task = (input().split())
        tasks[task[0]] = int(task[1])

    halfR = dict(sorted(tasks.items()))
    result = dict(sorted(halfR.items(), key=lambda x: x[1]))

    for key, val in result.items():
        print(f"{val} {key}")
sortTasks()